InformationRegisters/НастройкиПолученияЭлектронныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПолученияЭлектронныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НеПредлагатьСохранятьНастройки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПрикладнойВидЭД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрикладныеТипыЭлектронныхДокументовЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыДокументовЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыДокументовЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктВзаимозачета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктВыполненныхРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктНаПередачуПрав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОРасхождениях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСверкиВзаиморасчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ведомость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГарантийноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорнойДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПриемкиЕИСУКД</Name>
					<Comment>Титул поставщика из ЕИС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПриемкиЕИСУПД</Name>
					<Comment>Титул поставщика из ЕИС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросКоммерческихПредложений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОбОшибкеЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОПолучении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммерческоеПредложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрактЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСведенийОЗакупкеКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСведенийОРеализацииКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочныйСчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС11</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиночитаемаяДоверенность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПродажахКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОСписанииКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеОператораЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрайсЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредложениеОбАннулировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прикладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеКАкту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатРассмотренияАктаПриемкиЕИСУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатРассмотренияАктаПриемкиЕИСУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитыОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОЗакупкеКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРеализацииКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбИзмененииСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спецификация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНаОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварнаяНакладная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбУточнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПринятииКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьАктЗаказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьАктИсполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьВыпискаБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДопДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросЗонд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросНаОтзывЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросНочнойВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИзвещениеОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьКвитанция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПлатежноеТребование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПроизвольный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСоглашениеОбИзмененииСтоимостиПолучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТОРГ12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТОРГ12Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУКД_ИнформацияПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУКД_ИнформацияПродавца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУПД_ИнформацияПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУПД_ИнформацияПродавца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПриемкиСтроительныхРаботУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиПолученияЭлектронныхДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Получатель)";
	
	Ограничение.ТекстДляВнешнихПользователей =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Получатель)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ОбновлениеВерсииИБ


// СтандартныеПодсистемы.ОбновлениеВерсииИБ

// Регистрирует данные для обработчика обновления
// 
// Параметры:
//  Параметры - Структура - параметры.
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.НастройкиПолученияЭлектронныхДокументов;
	ПолноеИмяРегистра = МетаданныеОбъекта.ПолноеИмя();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.СпособВыборки        = ОбновлениеИнформационнойБазы.СпособВыборкиИзмеренияНезависимогоРегистраСведений();
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПолученияЭлектронныхДокументов.Отправитель,
	|	НастройкиПолученияЭлектронныхДокументов.Получатель,
	|	НастройкиПолученияЭлектронныхДокументов.ИдентификаторОтправителя,
	|	НастройкиПолученияЭлектронныхДокументов.ИдентификаторПолучателя
	|ИЗ
	|	РегистрСведений.НастройкиПолученияЭлектронныхДокументов КАК НастройкиПолученияЭлектронныхДокументов
	|ГДЕ
	|	НастройкиПолученияЭлектронныхДокументов.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовЭДО.ПустаяСсылка)
	|	И
	|		(НастройкиПолученияЭлектронныхДокументов.УдалитьВидДокумента <> ЗНАЧЕНИЕ(Перечисление.ТипыДокументовЭДО.ПустаяСсылка)
	|	ИЛИ НастройкиПолученияЭлектронныхДокументов.УдалитьПрикладнойВидЭД <> &ПустойПрикладнойТипДокумента)
	|	ИЛИ НастройкиПолученияЭлектронныхДокументов.СпособОбработки = ""ПоступлениеТоваровУслуг""
	|	И НастройкиПолученияЭлектронныхДокументов.УдалитьВидДокумента В (&ТипыДокументовИзменитьСпособОбработки)
	|;
	|//////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиПолученияЭлектронныхДокументов.Отправитель,
	|	НастройкиПолученияЭлектронныхДокументов.Получатель,
	|	НастройкиПолученияЭлектронныхДокументов.ИдентификаторОтправителя,
	|	НастройкиПолученияЭлектронныхДокументов.ИдентификаторПолучателя,
	|	НастройкиПолученияЭлектронныхДокументов.СпособОбработки
	|ИЗ
	|	РегистрСведений.НастройкиПолученияЭлектронныхДокументов КАК НастройкиПолученияЭлектронныхДокументов
	|ГДЕ
	|	НастройкиПолученияЭлектронныхДокументов.СпособОбработки = &СпособОбработкиНеОтражать";
	
	Запрос.УстановитьПараметр("ПустойПрикладнойТипДокумента",
		Метаданные.ОпределяемыеТипы.ПрикладныеТипыЭлектронныхДокументовЭДО.Тип.ПривестиЗначение());
	Запрос.УстановитьПараметр("ТипыДокументовИзменитьСпособОбработки", ТипыДокументовИзменитьСпособОбработки());
	Запрос.УстановитьПараметр("СпособОбработкиНеОтражать", НекорректныйСпособОбработкиНеОтражать());
	
	Результаты = Запрос.ВыполнитьПакет();
	
	Выгрузка = Результаты[0].Выгрузить();
	
	ВыборкаНекорректныеСпособыОбработки = Результаты[1].Выбрать();
	Пока ВыборкаНекорректныеСпособыОбработки.Следующий() Цикл
		// Проверка регистра строки, т.к. запрос его не учитывает.
		Если ВыборкаНекорректныеСпособыОбработки.СпособОбработки = НекорректныйСпособОбработкиНеОтражать() Тогда
			НоваяСтрока = Выгрузка.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНекорректныеСпособыОбработки);
		КонецЕсли;
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Выгрузка, ДополнительныеПараметры);
	
КонецПроцедуры

// Обработчик обновления.
// 
// Параметры:
//  Параметры - Структура - параметры.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.НастройкиПолученияЭлектронныхДокументов;
	ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
	
	ПараметрыОтметкиВыполнения = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	
	ВыбранныеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	СоответствиеВидовДокументов = ОбменСКонтрагентамиИнтеграция.СоответствиеВидовЭДВидамДокументовЭДО();
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0;
	
	Для Каждого СтрокаДанных Из ВыбранныеДанные Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Записать = Ложь;
			
			НаборЗаписей = РегистрыСведений.НастройкиПолученияЭлектронныхДокументов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Отправитель.Установить(СтрокаДанных.Отправитель);
			НаборЗаписей.Отбор.Получатель.Установить(СтрокаДанных.Получатель);
			НаборЗаписей.Отбор.ИдентификаторОтправителя.Установить(СтрокаДанных.ИдентификаторОтправителя);
			НаборЗаписей.Отбор.ИдентификаторПолучателя.Установить(СтрокаДанных.ИдентификаторПолучателя);
			ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(НаборЗаписей);
			
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() Тогда
				
				ОбработатьДанные_ЗаполнитьВидДокумента(НаборЗаписей, СоответствиеВидовДокументов, Записать);
				ОбработатьДанные_ИсправитьСпособОбработки(НаборЗаписей, Записать);
				
			КонецЕсли;

			Если Записать Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей, ПараметрыОтметкиВыполнения);
			КонецЕсли;
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			СтруктураКлючаЗаписи = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаДанных);
			КлючЗаписиСтрокой = ОбщегоНазначенияБЭДКлиентСервер.СтруктураВСтроку(СтруктураКлючаЗаписи);
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось обработать настройки получения электронных документов для: %1 по причине:
				|%2'"), СтрокаДанных.Отправитель, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка, МетаданныеОбъекта, КлючЗаписиСтрокой, ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ШаблонСообщения = НСтр("ru = 'Не удалось обработать некоторые настройки получения электронных документов (пропущены): %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ШаблонСообщения = НСтр("ru = 'Обработана очередная порция настроек получения электронных документов: %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбъектовОбработано);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация,
			МетаданныеОбъекта,, ТекстСообщения);
	КонецЕсли;
	
	Параметры.ПрогрессВыполнения.ОбработаноОбъектов =
		Параметры.ПрогрессВыполнения.ОбработаноОбъектов + ОбъектовОбработано;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
		Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Удаляет настройки отправки ЭДО
// 
//  Параметры - СписокЗначений - параметры учетной записи для удаления
//  АдресРезультата - Строка - путь временного хранилища
//
Функция УдалитьНастройкиОтраженияВУчете(Получатель, Отправитель, ИдентификаторПолучателя,
	ИдентификаторОтправителя) Экспорт
	
	Результат                = Истина;
	
	НаборЗаписей = РегистрыСведений.НастройкиПолученияЭлектронныхДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Отправитель.Установить(Отправитель);
	НаборЗаписей.Отбор.Получатель.Установить(Получатель);
	
	Если ЗначениеЗаполнено(ИдентификаторПолучателя) Тогда
		НаборЗаписей.Отбор.ИдентификаторПолучателя.Установить(ИдентификаторПолучателя);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторОтправителя) Тогда
		НаборЗаписей.Отбор.ИдентификаторОтправителя.Установить(ИдентификаторОтправителя);
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		// Попытка удаления. Управляемую блокировку устанавливать нет необходимости.
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		Информация = ИнформацияОбОшибке();
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось удалить настройки отражения в учете электронных документов по:
                                      |Организация: %1,
                                      |Контрагент: %2,
                                      |Идентификатор организации: %3.
                                      |Идентификатор контрагента: %4'"), Получатель, Отправитель,
                                      ИдентификаторПолучателя, ИдентификаторОтправителя);
		
		ЭлектронноеВзаимодействие.ОбработатьОшибку(НСтр("ru = 'Удаление настроек отражения в учете ЭДО'"), ПодробноеПредставлениеОшибки(Информация), ТекстОшибки);
		Результат = Ложь;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьДанные_ЗаполнитьВидДокумента(НаборЗаписей, СоответствиеВидовДокументов, Записать)
	
	ЗаписиДляУдаления = Новый Массив;
	ТипыДокументовИзменитьСпособОбработки = ТипыДокументовИзменитьСпособОбработки();
	Для Каждого Запись Из НаборЗаписей Цикл
		Если ТипыДокументовИзменитьСпособОбработки.Найти(Запись.УдалитьВидДокумента) <> Неопределено
			И Запись.СпособОбработки = "ПоступлениеТоваровУслуг" Тогда
			СпособОбработки = ?(Запись.УдалитьВидДокумента = Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав,
				"АктНаПередачуПрав", "АктВыполненныхРабот");
			Запись.СпособОбработки = СпособОбработки;
			Записать = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.ВидДокумента) Тогда
			Если ЗначениеЗаполнено(Запись.УдалитьПрикладнойВидЭД) Тогда
				ТипДокумента = Запись.УдалитьПрикладнойВидЭД;
			ИначеЕсли ЗначениеЗаполнено(Запись.УдалитьВидДокумента) Тогда 
				ТипДокумента = Запись.УдалитьВидДокумента;
			Иначе
				Возврат;
			КонецЕсли;
			Если Запись.УдалитьВидДокумента = Перечисления.ТипыДокументовЭДО.ПередачаТоваровМеждуОрганизациями Тогда
				ЗаписиДляУдаления.Добавить(Запись);
			КонецЕсли;
			Запись.ВидДокумента = СоответствиеВидовДокументов[ТипДокумента];
			Записать = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Запись Из ЗаписиДляУдаления Цикл
		НаборЗаписей.Удалить(Запись);
		Записать = Истина;
	КонецЦикла;
	
	ТаблицаНастроек = НаборЗаписей.Выгрузить();
	
	Отбор = Новый Структура("ВидДокумента",
		ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот));
	СтрокиАктВыполненныхРабот = ТаблицаНастроек.НайтиСтроки(Отбор);
	Если СтрокиАктВыполненныхРабот.Количество() > 1 Тогда
		УдаляемаяСтрока = ТаблицаНастроек.Найти(Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот);
		Если УдаляемаяСтрока <> Неопределено Тогда
			ТаблицаНастроек.Удалить(УдаляемаяСтрока);
		Иначе
			ТаблицаНастроек.Удалить(СтрокиАктВыполненныхРабот[0]);
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТаблицаНастроек Цикл
		СтрокаТаблицы.УдалитьВидДокумента = Перечисления.ТипыДокументовЭДО.ПустаяСсылка();
		СтрокаТаблицы.УдалитьПрикладнойВидЭД = Неопределено;
	КонецЦикла;
	
	НаборЗаписей.Загрузить(ТаблицаНастроек);
	
КонецПроцедуры

Процедура ОбработатьДанные_ИсправитьСпособОбработки(НаборЗаписей, Записать)
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Запись.СпособОбработки = НекорректныйСпособОбработкиНеОтражать() Тогда
			Запись.СпособОбработки = ИнтеграцияЭДО.СпособОбработки_НеОтражать();
			Записать = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ТипыДокументовИзменитьСпособОбработки()
	
	ТипыДокументов = Новый Массив;
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.УдалитьАктИсполнитель);
	ТипыДокументов.Добавить(Перечисления.ТипыДокументовЭДО.АктНаПередачуПрав);
	
	Возврат ТипыДокументов;
	
КонецФункции

Функция НекорректныйСпособОбработкиНеОтражать()
	
	Возврат "НЕОТРАЖАТЬ";
	
КонецФункции

#КонецОбласти

#КонецЕсли
